apache/nuttx/arch/arm/src/nrf52/nrf52_spi.c
#ifdef CONFIG_SPI_TRIGGER
static int nrf52_spi_trigger(struct spi_dev_s *dev)
{
  return -ENOSYS;
}
#endif

#ifdef CONFIG_PM
/****************************************************************************
 * Name: nrf52_spi_pm_prepare
 ****************************************************************************/

static int nrf52_spi_pm_prepare(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate)
{
  if (pmstate == PM_STANDBY || pmstate == PM_SLEEP)
    {
      bool active = false;

#ifdef CONFIG_NRF52_SPI0_MASTER
      active |= nrf52_spi_getreg(&g_spi0dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF52_SPI1_MASTER
      active |= nrf52_spi_getreg(&g_spi1dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF52_SPI2_MASTER
      active |= nrf52_spi_getreg(&g_spi2dev, SPIM_EVENTS_STARTED);
#endif
#ifdef CONFIG_NRF52_SPI3_MASTER
      active |= nrf52_spi_getreg(&g_spi3dev, SPIM_EVENTS_STARTED);
#endif

      if (active)
        {
          /* SPI is being used, cannot disable */

          return -1;
        }
      else
        {
          /* SPI is inactive, can go to sleep */

          return 0;
        }
    }
  else
    {
      /* We can always go to any other state */

      return 0;
    }
}

/****************************************************************************
 * Name: nrf52_spi_pm_notify
 ****************************************************************************/

static void nrf52_spi_pm_notify(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate)
{
  if (pmstate == PM_SLEEP || pmstate == PM_STANDBY)
    {
      /* Deinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF52_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf52_spi_deinit(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf52_spi_deinit(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf52_spi_deinit(&g_spi2dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf52_spi_deinit(&g_spi3dev);
        }
#endif
    }
  else
    {
      /* Reinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF52_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf52_spi_init(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf52_spi_init(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf52_spi_init(&g_spi2dev);
        }
#endif

#ifdef CONFIG_NRF52_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf52_spi_init(&g_spi3dev);
        }
#endif
    }
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf52_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI port.
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *nrf52_spibus_initialize(int port)
{
  struct nrf52_spidev_s *priv = NULL;

  /* Get SPI driver data */

  switch (port)
    {
#ifdef CONFIG_NRF52_SPI0_MASTER
      case 0:
        {
          priv = &g_spi0dev;
          break;
        }
#endif

#ifdef CONFIG_NRF52_SPI1_MASTER
      case 1:
        {
          priv = &g_spi1dev;
          break;
        }
#endif

#ifdef CONFIG_NRF52_SPI2_MASTER
      case 2:
        {
          priv = &g_spi2dev;
          break;
        }
#endif

#ifdef CONFIG_NRF52_SPI3_MASTER
      case 3:
        {
          priv = &g_spi3dev;
          break;
        }
#endif

      default:
        {
          goto errout;
        }
    }

  /* Initialize the SPI */

  nrf52_spi_init(priv);

  /* Mark device as initialized */

  priv->initialized = true;

#ifdef CONFIG_NRF52_SPI_MASTER_INTERRUPTS
  /* Attach SPI interrupt */

  irq_attach(priv->irq, nrf52_spi_isr, priv);
  up_enable_irq(priv->irq);
#endif

errout:
  return (struct spi_dev_s *)priv;
}
